package com.woc.common.common.utils;
import java.text.NumberFormat;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * 与String相关的工具方法集
 * @author Jimmy
 *
 */
public class StringUtil {

    public static String getMatcher(String regex, String source) {
        Pattern pattern = Pattern.compile(regex);
        Matcher matcher = pattern.matcher(source);
        while (matcher.find()) {
            return matcher.group(0);
        }
        return null;
    }

    public static String fetchUp(Integer length,long num){
        NumberFormat formatter = NumberFormat.getNumberInstance();
        formatter.setMinimumIntegerDigits(length);
        formatter.setGroupingUsed(false);
        return formatter.format(num);
    }

    /*public static void main(String[] args) {
        String url = "var kbxx = [{\"kcmc\":\"形势与政策(4)\",\"kcbh\":\"1400064\",\"jxbmc\":\"150601,150602,150603,151101,151102,151103,151104,151105,151106,151005,151006,151007,151003,151004,151001,151002\",\"kcrwdm\":\"1035551\",\"jcdm2\":\"07,08\",\"zcs\":\"11\",\"xq\":\"5\",\"jxcdmcs\":\"吕志和礼堂\",\"teaxms\":\"罗华丽\"},{\"kcmc\":\"电工与电子技术基础\",\"kcbh\":\"0700190\",\"jxbmc\":\"151103\",\"kcrwdm\":\"1035607\",\"jcdm2\":\"01,02\",\"zcs\":\"13,2,3,8,9,11,14,4,6\",\"xq\":\"1\",\"jxcdmcs\":\"黄浩川教学楼401\",\"teaxms\":\"幸芦笙\"},{\"kcmc\":\"电工与电子技术基础\",\"kcbh\":\"0700190\",\"jxbmc\":\"151103\",\"kcrwdm\":\"1035607\",\"jcdm2\":\"09,10,11\",\"zcs\":\"15,10\",\"xq\":\"1\",\"jxcdmcs\":\"综合实验大楼603\",\"teaxms\":\"陈宇新\"},{\"kcmc\":\"电工与电子技术基础\",\"kcbh\":\"0700190\",\"jxbmc\":\"151103\",\"kcrwdm\":\"1035607\",\"jcdm2\":\"09,10,11\",\"zcs\":\"6,7\",\"xq\":\"2\",\"jxcdmcs\":\"综合实验大楼603\",\"teaxms\":\"陈宇新\"},{\"kcmc\":\"电工与电子技术基础\",\"kcbh\":\"0700190\",\"jxbmc\":\"151103\",\"kcrwdm\":\"1035607\",\"jcdm2\":\"01,02\",\"zcs\":\"11,3,4,8,9,13,14,2,6\",\"xq\":\"3\",\"jxcdmcs\":\"黄浩川教学楼404\",\"teaxms\":\"幸芦笙\"},{\"kcmc\":\"清洁生产与循环经济\",\"kcbh\":\"1100630\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035640\",\"jcdm2\":\"03,04\",\"zcs\":\"6,4,5,7,8,9\",\"xq\":\"2\",\"jxcdmcs\":\"黄浩川教学楼204\",\"teaxms\":\"谢珊\"},{\"kcmc\":\"清洁生产与循环经济\",\"kcbh\":\"1100630\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035640\",\"jcdm2\":\"01,02\",\"zcs\":\"10,11\",\"xq\":\"4\",\"jxcdmcs\":\"黄浩川教学楼202\",\"teaxms\":\"谢珊\"},{\"kcmc\":\"清洁生产与循环经济\",\"kcbh\":\"1100630\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035640\",\"jcdm2\":\"05,06\",\"zcs\":\"10,4,6,7,8,11,5,9\",\"xq\":\"5\",\"jxcdmcs\":\"黄浩川教学楼204\",\"teaxms\":\"谢珊\"},{\"kcmc\":\"毛泽东思想和中国特色社会主义理论体系概论(1)\",\"kcbh\":\"1400041\",\"jxbmc\":\"151103,151104,151105,151106\",\"kcrwdm\":\"1035647\",\"jcdm2\":\"03,04\",\"zcs\":\"11,10\",\"xq\":\"1\",\"jxcdmcs\":\"北主楼302\",\"teaxms\":\"王志润\"},{\"kcmc\":\"毛泽东思想和中国特色社会主义理论体系概论(1)\",\"kcbh\":\"1400041\",\"jxbmc\":\"151103,151104,151105,151106\",\"kcrwdm\":\"1035647\",\"jcdm2\":\"05,06\",\"zcs\":\"15,16\",\"xq\":\"1\",\"jxcdmcs\":\"北主楼302\",\"teaxms\":\"王志润\"},{\"kcmc\":\"毛泽东思想和中国特色社会主义理论体系概论(1)\",\"kcbh\":\"1400041\",\"jxbmc\":\"151103,151104,151105,151106\",\"kcrwdm\":\"1035647\",\"jcdm2\":\"07,08\",\"zcs\":\"6,7,8,9\",\"xq\":\"3\",\"jxcdmcs\":\"北主楼305\",\"teaxms\":\"王志润\"},{\"kcmc\":\"毛泽东思想和中国特色社会主义理论体系概论(1)\",\"kcbh\":\"1400041\",\"jxbmc\":\"151103,151104,151105,151106\",\"kcrwdm\":\"1035647\",\"jcdm2\":\"07,08\",\"zcs\":\"8,9,6,7\",\"xq\":\"5\",\"jxcdmcs\":\"北主楼305,北主楼704\",\"teaxms\":\"王志润\"},{\"kcmc\":\"毛泽东思想和中国特色社会主义理论体系概论(1)\",\"kcbh\":\"1400041\",\"jxbmc\":\"151103,151104,151105,151106\",\"kcrwdm\":\"1035647\",\"jcdm2\":\"09,10\",\"zcs\":\"10,15,11,16\",\"xq\":\"5\",\"jxcdmcs\":\"北主楼305,南主楼239\",\"teaxms\":\"王志润\"},{\"kcmc\":\"固体废弃物处理处置工程\",\"kcbh\":\"1100650\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035652\",\"jcdm2\":\"05,06\",\"zcs\":\"6,2,3,5,7,8,9,4\",\"xq\":\"1\",\"jxcdmcs\":\"北主楼302\",\"teaxms\":\"龚春生\"},{\"kcmc\":\"固体废弃物处理处置工程\",\"kcbh\":\"1100650\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035652\",\"jcdm2\":\"09,10\",\"zcs\":\"17,14,15,16,18,10,11,13\",\"xq\":\"2\",\"jxcdmcs\":\"北主楼302\",\"teaxms\":\"龚春生\"},{\"kcmc\":\"固体废弃物处理处置工程\",\"kcbh\":\"1100650\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035652\",\"jcdm2\":\"09,10\",\"zcs\":\"17,11,13,15,16,18,10,14\",\"xq\":\"4\",\"jxcdmcs\":\"北主楼302\",\"teaxms\":\"龚春生\"},{\"kcmc\":\"环境工程专业英语\",\"kcbh\":\"1100660\",\"jxbmc\":\"151103\",\"kcrwdm\":\"1035673\",\"jcdm2\":\"01,02\",\"zcs\":\"6,3,4,7,8,9,2,5\",\"xq\":\"4\",\"jxcdmcs\":\"黄浩川教学楼502\",\"teaxms\":\"李辰\"},{\"kcmc\":\"大气污染控制工程\",\"kcbh\":\"1100620\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035685\",\"jcdm2\":\"03,04\",\"zcs\":\"17,18,3,4,5,7,8,9,13,14,15,16,2,6,10,11\",\"xq\":\"3\",\"jxcdmcs\":\"马兰芳教学楼204\",\"teaxms\":\"李秋华\"},{\"kcmc\":\"电子实习\",\"kcbh\":\"0700110\",\"jxbmc\":\"151103\",\"kcrwdm\":\"1035746\",\"jcdm2\":\"05,06,07,08\",\"zcs\":\"16,15\",\"xq\":\"3\",\"jxcdmcs\":\"综合实验大楼503\",\"teaxms\":\"李烨\"},{\"kcmc\":\"电子实习\",\"kcbh\":\"0700110\",\"jxbmc\":\"151103\",\"kcrwdm\":\"1035746\",\"jcdm2\":\"01,02,03,04\",\"zcs\":\"16,15\",\"xq\":\"5\",\"jxcdmcs\":\"综合实验大楼503\",\"teaxms\":\"李烨\"},{\"kcmc\":\"水污染控制工程\",\"kcbh\":\"1100610\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035749\",\"jcdm2\":\"01,02\",\"zcs\":\"6,3,4,5,7,8,9,2\",\"xq\":\"2\",\"jxcdmcs\":\"北主楼305\",\"teaxms\":\"卢俊彩,李冰\"},{\"kcmc\":\"水污染控制工程\",\"kcbh\":\"1100610\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035749\",\"jcdm2\":\"09,10\",\"zcs\":\"17,18,19,13,14,15,16,10,11\",\"xq\":\"3\",\"jxcdmcs\":\"北主楼305\",\"teaxms\":\"卢俊彩\"},{\"kcmc\":\"水污染控制工程\",\"kcbh\":\"1100610\",\"jxbmc\":\"151103,151104,151105\",\"kcrwdm\":\"1035749\",\"jcdm2\":\"03,04\",\"zcs\":\"5,2,3,4,6,7,8\",\"xq\":\"5\",\"jxcdmcs\":\"北主楼305\",\"teaxms\":\"卢俊彩,李冰\"},{\"kcmc\":\"水污染控制实验\",\"kcbh\":\"1100950\",\"jxbmc\":\"拆分班级1:151103[22]\",\"kcrwdm\":\"1035610\",\"jcdm2\":\"09,10,11,12\",\"zcs\":\"6,3,4,7,8,9\",\"xq\":\"3\",\"jxcdmcs\":\"德胜楼502\",\"teaxms\":\"龚春生\"},{\"kcmc\":\"大气污染控制实验\",\"kcbh\":\"1100960\",\"jxbmc\":\"拆分班级1:151103[22]\",\"kcrwdm\":\"1035756\",\"jcdm2\":\"01,02,03,04\",\"zcs\":\"13,14,10,11\",\"xq\":\"2\",\"jxcdmcs\":\"德胜楼505\",\"teaxms\":\"李秋华\"}]";
        String regex = "\\[\\{.*\\}\\]";
//        String regex = "(\\d{1,3}\\.){1,3}(\\d{1,3})";
        System.out.println(getMatcher(regex,url));
    }*/

}
